#### SetColumnWidths Method

---

|  |
| --- |
| ColorFillLegend Class   See Also |

Sets array of column widths.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void SetColumnWidths( 	IList<double> widths ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetColumnWidths ( _ 	widths As IList(Of Double) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetColumnWidths( 	IList<double>^ widths ) ``` |

#### Parameters

widths
:   Type:  System.Collections.Generic IList   Double

# Remarks

Input array length must be the same as what  GetColumnWidths  returns. It can only contain positive values.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Array is not valid. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ColorFillLegend Class

Autodesk.Revit.DB Namespace